Narin-Laboratory/libudawa-esp32/src/libudawa.h
/**
 * UDAWA - Universal Digital Agriculture Watering Assistant
 * Function helper library for ESP32 based UDAWA multi-device firmware development
 * Licensed under aGPLv3
 * Researched and developed by PRITA Research Group & Narin Laboratory
 * prita.undiknas.ac.id | narin.co.id
**/

#ifndef libudawa_h
#define libudawa_h

#include <secret.h>
#include <esp32-hal-log.h>
#include <esp_int_wdt.h>
#include <esp_task_wdt.h>
#include <FS.h>
#include <SPIFFS.h>
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClientSecure.h>
#include <ArduinoJson.h>
#include <StreamUtils.h>
#include <ArduinoOTA.h>
#include "logging.h"
#include "serialLogger.h"
#include <ESP32Time.h>
#include <ESPmDNS.h>
#include <WiFiUdp.h>
#include <ThingsBoard.h>
#include <Update.h>
#include <HTTPClient.h>
#ifdef USE_WEB_IFACE
#include <WebServer.h>
#include <WebSocketsServer.h>
#endif

#define _TASK_TIMEOUT
#include <TaskScheduler.h>

#define countof(a) (sizeof(a) / sizeof(a[0]))
#define COMPILED __DATE__ " " __TIME__
#define S2_RX 16
#define S2_TX 17
#define WIFI_FALLBACK_COUNTER 3
#ifndef DOCSIZE
  #define DOCSIZE 1024
#endif

#ifndef DOCSIZE_MIN
  #define DOCSIZE_MIN 384
#endif

namespace libudawa
{

const char* configFile = "/cfg.json";
const char* configFileCoMCU = "/comcu.json";
bool FLAG_IOT_SUBSCRIBE = false;
bool FLAG_IOT_INIT = false;
bool FLAG_OTA_UPDATE_INIT = false;
bool WIFI_IS_DEFAULT = false;

struct Config
{
  char hwid[16];
  char name[24];
  char model[16];
  char group[16];
  uint8_t logLev;

  char broker[48];
  uint16_t port;
  char wssid[24];
  char wpass[24];
  char dssid[24];
  char dpass[24];
  char upass[64];
  char accTkn[24];
  bool provSent;

  char provDK[24];
  char provDS[24];

  int gmtOff;

  bool fIoT;
  bool fWOTA;
  bool fIface;
  char hname[40];
  char htU[24];
  char htP[24];

  uint8_t tbDisco = 0;

  char logIP[16] = "192.168.18.255";
  uint16_t logPrt = 29514;

  #ifdef USE_WEB_IFACE
  uint8_t wsCount = 0;
  #endif

  bool currentFWSent = false;
  bool updateRequestSent = false;
};

struct ConfigCoMCU
{
  bool fP;
  uint16_t bFr;
  bool fB;
  uint8_t pBz;
  uint8_t pLR;
  uint8_t pLG;
  uint8_t pLB;
  uint8_t lON;
};

class ESP32UDPLogger : public ILogHandler
{
    public:
        void log_message(const char *tag, const LogLevel level, const char *fmt, va_list args) override;
};

uint32_t micro2milli(uint32_t hi, uint32_t lo);
double round2(double value);
void reboot();
void plannedReboot(int countdown);
char* getDeviceId();
void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info);
void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info);
void configLoadFailSafe();
void configLoad();
void configSave();
void configReset();
void configCoMCULoadFailSafe();
void configCoMCULoad();
void configCoMCUSave();
void configCoMCUReset();
bool loadFile(const char* filePath, char* buffer);
void processProvisionResponse(const Provision_Data &data);
void processSharedAttributeRequest(const Shared_Attribute_Data &data);
void processClientAttributeRequest(const Shared_Attribute_Data &data);
void processSharedAttributeUpdate(const Shared_Attribute_Data &data);
void (*processSharedAttributeUpdateCb)(const Shared_Attribute_Data &data);
void startup();
bool wifiKeeperEnable();
void wifiKeeperDisable();
void wifiKeeperCb();
void udawa();
void serialWriteToCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc, bool isRpc);
void serialReadFromCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc);
void syncConfigCoMCU();
void readSettings(StaticJsonDocument<DOCSIZE> &doc,const char* path);
void writeSettings(StaticJsonDocument<DOCSIZE> &doc, const char* path);
void setCoMCUPin(uint8_t pin, uint8_t op, uint8_t mode, uint16_t aval, uint8_t state);
void rtcUpdate(long ts = 0);
void setBuzzer(int32_t beepCount, uint16_t beepDelay);
void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay);
void emitAlarm(int code);
void (*emitAlarmCb)(const int code);
#ifdef USE_WEB_IFACE
void onWsEventCb(uint8_t num, WStype_t type, uint8_t * payload, size_t length);
void (*wsEventCb)(const JsonObject &payload);
void webSendFile(String path, String type);
#endif
bool ifaceLoopEnable();
void ifaceLoopCb();
void ifaceLoopDisable();
bool wifiOtaEnable();
void wifiOtaLoopCb();
void wifiOtaDisable();
void tbLoopCb();
void tbLoopDisable();
bool tbKeeperEnable();
void tbKeeperCb();
void tbKeeperDisable();
void tbKeeperProvCb();
void tbOtaFinishedCb(const bool& success);
void tbOtaProgressCb(const uint32_t& currentChunk, const uint32_t& totalChuncks);
void (*httpOtaOnUpdateFinishedCb)(const int partition);
void updateSpiffs();
void (*onTbDisconnectedCb)();
void (*onTbConnectedCb)();
bool plannedRebootOnEnable();
void (*plannedRebootOnEnableCb)();
RPC_Response processConfigSave(const RPC_Data &data);
RPC_Response processConfigCoMCUSave(const RPC_Data &data);
RPC_Response processSaveSettings(const RPC_Data &data);
void (*processSaveSettingsCb)();
RPC_Response processSetPanic(const RPC_Data &data);
void (*processSetPanicCb)(const RPC_Data &data);
RPC_Response processUpdateSpiffs(const RPC_Data &data);
RPC_Response processReboot(const RPC_Data &data);
RPC_Response processGenericClientRPC(const RPC_Data &data);
RPC_Response (*processGenericClientRPCCb)(const RPC_Data &data);
void syncClientAttrCb();
void (*onSyncClientAttrCb)();


ESP32SerialLogger serial_logger;
ESP32UDPLogger udp_logger;
LogManager *log_manager = LogManager::GetInstance(LogLevel::VERBOSE);
WiFiClientSecure ssl = WiFiClientSecure();
WiFiMulti wifiMulti;
Config config;
ConfigCoMCU configcomcu;
ThingsBoard tb(ssl, DOCSIZE_MIN);
ESP32Time rtc(0);
Scheduler r;
#ifdef USE_WEB_IFACE
WebServer web(80);
WebSocketsServer ws = WebSocketsServer(81);
#endif

// Shared attributes we want to request from the server
constexpr const char FW_TAG_KEY[] PROGMEM = "fw_tag";
constexpr std::array<const char*, 6U> REQUESTED_SHARED_ATTRIBUTES = {
  FW_CHKS_KEY,
  FW_CHKS_ALGO_KEY,
  FW_SIZE_KEY,
  FW_TAG_KEY,
  FW_TITLE_KEY,
  FW_VER_KEY
};

// Client-side attributes we want to request from the server
constexpr std::array<const char*, 1U> REQUESTED_CLIENT_ATTRIBUTES = {
  PSTR("fIface")
};

// Client-side RPC that can be executed from cloud
const std::array<RPC_Callback, 7U> clientRPCCallbacks = {
  RPC_Callback{ PSTR("configSave"),    processConfigSave },
  RPC_Callback{ PSTR("configCoMCUSave"), processConfigCoMCUSave },
  RPC_Callback{ PSTR("saveSettings"), processSaveSettings },
  RPC_Callback{ PSTR("updateSpiffs"), processUpdateSpiffs },
  RPC_Callback{ PSTR("setPanic"), processSetPanic }, 
  RPC_Callback{ PSTR("reboot"),  processReboot},
  RPC_Callback{ PSTR("generic"), processGenericClientRPC }
};

const Attribute_Request_Callback tbSharedCb(REQUESTED_SHARED_ATTRIBUTES.cbegin(), REQUESTED_SHARED_ATTRIBUTES.cend(), &processSharedAttributeRequest);
const Attribute_Request_Callback tbClientCb(REQUESTED_CLIENT_ATTRIBUTES.cbegin(), REQUESTED_CLIENT_ATTRIBUTES.cend(), &processClientAttributeRequest);
const OTA_Update_Callback tbOtaCb(&tbOtaProgressCb, &tbOtaFinishedCb, CURRENT_FIRMWARE_TITLE, CURRENT_FIRMWARE_VERSION, 5, 1024);
const Shared_Attribute_Callback tbSharedAttrUpdateCb(&processSharedAttributeUpdate);


Task wifiKeeperLoop(30 * TASK_SECOND, TASK_FOREVER, &wifiKeeperCb, &r, 0, &wifiKeeperEnable, &wifiKeeperDisable);
Task tbKeeperLoop(120 * TASK_SECOND, TASK_FOREVER, &tbKeeperCb, &r, 0, &tbKeeperEnable, &tbKeeperDisable);
Task ifaceLoop(10, TASK_FOREVER, &ifaceLoopCb, &r, 0, &ifaceLoopEnable, &ifaceLoopDisable);
Task tbLoop(10, TASK_FOREVER, &tbLoopCb, &r, 0, NULL, &tbLoopDisable);
Task wifiOtaLoop(10, TASK_FOREVER, &wifiOtaLoopCb, &r, 0, &wifiOtaEnable, &wifiOtaDisable);
Task taskPlannedReboot(TASK_IMMEDIATE, TASK_ONCE, &reboot, &r, 0, &plannedRebootOnEnable, NULL);
Task taskSyncClientAttr(TASK_IMMEDIATE, TASK_ONCE, &syncClientAttrCb, &r, 0, NULL, NULL);
Task taskUpdateSpiffs(TASK_IMMEDIATE, TASK_ONCE, &updateSpiffs, &r, 0, NULL, NULL);

