Narin-Laboratory/libudawa-esp32/src/libudawa.h
    ifaceLoop.setTimeout(120 * TASK_SECOND, false);
    return true;
  }
  return false;
}

void ifaceLoopCb(){
  #ifdef USE_WEB_IFACE
    ws.loop();
    web.handleClient();
  #endif
  ifaceLoop.resetTimeout();
}

void ifaceLoopDisable(){
  if(ifaceLoop.timedOut()){
    log_manager->verbose(PSTR(__func__),PSTR("ifaceLoop has timed out. Restarting...\n"));
    ifaceLoop.setInterval(10);
    ifaceLoop.setIterations(TASK_FOREVER);
    ifaceLoop.enable();
  }
}

bool wifiOtaEnable(){
  if(config.fWOTA){
    ArduinoOTA.setHostname(config.hname);
    ArduinoOTA.setPasswordHash(config.upass);
    ArduinoOTA.begin();

    ArduinoOTA
      .onStart([]()
      {
        String type;
        if (ArduinoOTA.getCommand() == U_FLASH)
            type = "sketch";
        else // U_SPIFFS
            type = "filesystem";
            SPIFFS.end();
        log_manager->warn(PSTR(__func__),PSTR("Starting OTA %s\n"), type.c_str());
      })
      .onEnd([]()
      {
        log_manager->warn(PSTR(__func__),PSTR("Device rebooting...\n"));
        reboot();
      })
      .onProgress([](unsigned int progress, unsigned int total)
      {
        log_manager->warn(PSTR(__func__),PSTR("OTA progress: %d/%d\n"), progress, total);
      })
      .onError([](ota_error_t error)
      {
        log_manager->warn(PSTR(__func__),PSTR("OTA Failed: %d\n"), error);
        reboot();
      }
    );
    log_manager->verbose(PSTR(__func__),PSTR("Enabled.\n"));
    wifiOtaLoop.setTimeout(120 * TASK_SECOND, false);
    return true;
  }
  return false;
}

void wifiOtaLoopCb(){
  ArduinoOTA.handle();
  wifiOtaLoop.resetTimeout();
}

void wifiOtaDisable(){
  if(wifiOtaLoop.timedOut()){
    log_manager->verbose(PSTR(__func__),PSTR("wifiOtaLoop has timed out. Restarting...\n"));
    wifiOtaLoop.setInterval(10);
    wifiOtaLoop.setIterations(TASK_FOREVER);
    wifiOtaLoop.enable();
  }
  ArduinoOTA.end();
  log_manager->verbose(PSTR(__func__),PSTR("Disabled.\n"));
}

void tbLoopCb(){
  tb.loop();
}
void tbLoopDisable(){
  tb.disconnect();
  log_manager->verbose(PSTR(__func__),PSTR("Disabled.\n"));
}

bool tbKeeperEnable(){
  if(!config.fIoT){
    return false;
  }

  int freeHeap = ESP.getFreeHeap();
  log_manager->info(PSTR(__func__),PSTR("Initializing IoT, available memory: %d\n"), freeHeap);
  if(freeHeap < 92000)
  {
    log_manager->warn(PSTR(__func__),PSTR("Unable to init IoT, insufficient memory: %d\n"), freeHeap);
    return false;
  }

  if(!WiFi.isConnected()){
    log_manager->warn(PSTR(__func__),PSTR("Unable to init IoT, WiFi is not connected!\n"));
    return false;
  }

  tbKeeperLoop.setTimeout(120 * TASK_SECOND, false);
  tbLoop.setInterval(10);
  tbLoop.setIterations(TASK_FOREVER);
  tbLoop.enable();

  log_manager->verbose(PSTR(__func__),PSTR("Enabled.\n"));
  return true;
}
void tbKeeperCb(){
  long startMillis = millis();
  if(!config.provSent)
  {
    tbKeeperLoop.resetTimeout();
    tbKeeperLoop.setCallback(tbKeeperProvCb);
    tbKeeperLoop.forceNextIteration();
  }
  else{
    if(!tb.connected())
    {
      onTbDisconnectedCb();
      log_manager->info(PSTR(__func__),PSTR("Connecting to broker %s:%d\n"), config.broker, config.port);
      if(!tb.connect(config.broker, config.accTkn, config.port, config.name))
      {
        config.tbDisco++;
        log_manager->warn(PSTR(__func__),PSTR("Failed to connect to IoT Broker %s (%d)\n"), config.broker, config.tbDisco);
        if(config.tbDisco >= 10){
          config.provSent = 0;
          config.tbDisco = 0;
        }
        tbKeeperLoop.resetTimeout();
        return;
      }

      bool tbShared_status = tb.Shared_Attributes_Request(tbSharedCb);
      bool tbClient_status = tb.Client_Attributes_Request(tbClientCb);
      bool tbSharedUpdate_status = tb.Shared_Attributes_Subscribe(tbSharedAttrUpdateCb);
      bool tbClientRPC_status = tb.RPC_Subscribe(clientRPCCallbacks.cbegin(), clientRPCCallbacks.cend());
      log_manager->verbose(PSTR(__func__), PSTR("TB Subscribe status: SharedAttr(%d) - ClientAttr(%d) - SharedUpdate(%d) - clientRPC(%d)\n"), tbShared_status, 
        tbClient_status, tbSharedUpdate_status, tbClientRPC_status);
      onTbConnectedCb();

      if (!config.currentFWSent) {
        constexpr char FW_STATE_UPDATED[] PROGMEM = "UPDATED";
        config.currentFWSent = tb.Firmware_Send_Info(CURRENT_FIRMWARE_TITLE, CURRENT_FIRMWARE_VERSION) && tb.Firmware_Send_State(FW_STATE_UPDATED);
      }
      if (!config.updateRequestSent) {
        config.updateRequestSent = tb.Subscribe_Firmware_Update(tbOtaCb);
      }

      taskSyncClientAttr.setInterval(TASK_IMMEDIATE);
      taskSyncClientAttr.setIterations(TASK_ONCE);
      taskSyncClientAttr.enableDelayed(10 * TASK_SECOND);
      log_manager->info(PSTR(__func__),PSTR("IoT Connected!\n"));
    }
  }
  tbKeeperLoop.resetTimeout();

  log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);
}

void tbKeeperProvCb(){
  log_manager->info(PSTR(__func__),PSTR("Starting provision initiation to %s:%d\n"),  config.broker, config.port);
  if (tb.connect(config.broker, "provision", config.port)) {
    const Provision_Callback provisionCallback(Access_Token(), &processProvisionResponse, config.provDK, config.provDS, config.name);
    if(tb.Provision_Request(provisionCallback))
    {
      log_manager->info(PSTR(__func__),PSTR("Connected to provisioning server: %s:%d\n"),  config.broker, config.port);
    }
  }
  else
  {
    log_manager->warn(PSTR(__func__),PSTR("Failed to connect to provisioning server: %s:%d\n"),  config.broker, config.port);
    return;
  }
  
}

void tbKeeperDisable(){
  if(tbKeeperLoop.timedOut()){
    log_manager->verbose(PSTR(__func__),PSTR("tbKeeperLoop has timed out. Restarting...\n"));
    tbKeeperLoop.setInterval(30 * TASK_SECOND);
    tbKeeperLoop.setIterations(TASK_FOREVER);
    tbKeeperLoop.enable();
  }
  tbLoop.disable();
  log_manager->verbose(PSTR(__func__),PSTR("Disabled.\n"));
}

void emitAlarm(int code){
  tb.sendTelemetryInt(PSTR("alarm"), code);
  emitAlarmCb(code);
  log_manager->error(PSTR(__func__), PSTR("%i\n"), code);
}

void rtcUpdate(long ts){
  long startMillis = millis();
  if(ts == 0){
    configTime(config.gmtOff, 0, "pool.ntp.org");
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)){
      rtc.setTimeStruct(timeinfo);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via NTP: %s GMT Offset:%d (%d) \n"), rtc.getDateTime().c_str(), config.gmtOff, config.gmtOff / 3600);
    }
  }else{
      rtc.setTime(ts);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via timestamp: %s\n"), rtc.getDateTime().c_str());
  }
  log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);
}

void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s and %s) Disconnected!\n"), config.wssid, config.dssid);
  if(config.fIoT){
    tbKeeperLoop.disable();
  }
  if(config.fIface){
    ifaceLoop.disable();
  }
  if(config.fWOTA){
    wifiOtaLoop.disable();
  }
}

void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info)
{
  long startMillis = millis();
  IPAddress ip = WiFi.localIP();
  char ipa[25];
  sprintf(ipa, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s) IP Assigned: %s!\n"), WiFi.SSID().c_str(), ipa);

  ssl.setCACert(CA_CERT);

  MDNS.begin(config.hname);
  MDNS.addService("http", "tcp", 80);
  log_manager->info(PSTR(__func__),PSTR("Started MDNS on %s\n"), config.hname);

  rtcUpdate(0);
  if(config.fWOTA){
    wifiOtaLoop.enable();
  }

  if(config.fIface){
    ifaceLoop.enable();
  }

  if(config.fIoT){
    tbKeeperLoop.enable();
  }

  log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);
}

