Narin-Laboratory/libudawa-esp32/src/libudawa.h
void syncClientAttrCb(){
  long startMillis = millis();

  String ip = WiFi.localIP().toString();
  
  StaticJsonDocument<1024> doc;
  char buffer[1024];

  doc[PSTR("ipad")] = ip;
  doc[PSTR("compdate")] = COMPILED;
  doc[PSTR("fmTitle")] = CURRENT_FIRMWARE_TITLE;
  doc[PSTR("fmVersion")] = CURRENT_FIRMWARE_VERSION;
  doc[PSTR("stamac")] = WiFi.macAddress();
  doc[PSTR("apmac")] = WiFi.softAPmacAddress();
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();
  doc[PSTR("flFree")] = ESP.getFreeSketchSpace();
  doc[PSTR("fwSize")] = ESP.getSketchSize();
  doc[PSTR("flSize")] = ESP.getFlashChipSize();
  doc[PSTR("dSize")] = (int)SPIFFS.totalBytes(); 
  doc[PSTR("dUsed")] = (int)SPIFFS.usedBytes();
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();
  doc[PSTR("sdkVer")] = ESP.getSdkVersion();
  doc[PSTR("model")] = config.model;
  doc[PSTR("name")] = config.name;
  doc[PSTR("group")] = config.group;
  doc[PSTR("broker")] = config.broker;
  doc[PSTR("port")] = config.port;
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();
  doc[PSTR("wssid")] = config.wssid;
  doc[PSTR("ap")] = WiFi.SSID();
  doc[PSTR("wpass")] = config.wpass;
  doc[PSTR("dssid")] = config.dssid;
  doc[PSTR("dpass")] = config.dpass;
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();
  doc[PSTR("upass")] = config.upass;
  doc[PSTR("accTkn")] = config.accTkn;
  doc[PSTR("provDK")] = config.provDK;
  doc[PSTR("provDS")] = config.provDS;
  doc[PSTR("logLev")] = config.logLev;
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();
  doc[PSTR("gmtOff")] = config.gmtOff;
  doc[PSTR("bFr")] = configcomcu.bFr;
  doc[PSTR("fP")] = (int)configcomcu.fP;
  doc[PSTR("fB")] = (int)configcomcu.fB;
  doc[PSTR("fIoT")] = (int)config.fIoT;
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();
  doc[PSTR("fWOTA")] = (int)config.fWOTA;
  doc[PSTR("fIface")] = (int)config.fIface;
  doc[PSTR("hname")] = config.hname;
  doc[PSTR("logIP")] = config.logIP;
  doc[PSTR("logPrt")] = config.logPrt;
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();
  doc[PSTR("pBz")] = configcomcu.pBz;
  doc[PSTR("pLR")] = configcomcu.pLR;
  doc[PSTR("pLG")] = configcomcu.pLG;
  doc[PSTR("pLB")] = configcomcu.pLB;
  doc[PSTR("htU")] = config.htU;
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();
  doc[PSTR("htP")] = config.htP;
  doc[PSTR("lON")] = configcomcu.lON;
  serializeJson(doc, buffer);
  tb.sendAttributeJSON(buffer);
  doc.clear();

  if(config.wsCount > 0){
    JsonObject attr = doc.createNestedObject("attr");
    attr[PSTR("ipad")] = ip.c_str();
    attr[PSTR("compdate")] = COMPILED;
    attr[PSTR("fmTitle")] = CURRENT_FIRMWARE_TITLE;
    attr[PSTR("fmVersion")] = CURRENT_FIRMWARE_VERSION;
    attr[PSTR("stamac")] = WiFi.macAddress();
    attr[PSTR("apmac")] = WiFi.softAPmacAddress();
    attr[PSTR("flFree")] = ESP.getFreeSketchSpace();
    attr[PSTR("fwSize")] = ESP.getSketchSize();
    attr[PSTR("flSize")] = ESP.getFlashChipSize();
    attr[PSTR("dSize")] = (int)SPIFFS.totalBytes(); 
    attr[PSTR("dUsed")] = (int)SPIFFS.usedBytes();
    attr[PSTR("sdkVer")] = ESP.getSdkVersion();
    serializeJson(doc, buffer);
    ws.broadcastTXT(buffer);
    doc.clear();
    JsonObject cfg = doc.createNestedObject("cfg");
    cfg[PSTR("name")] = config.name;
    cfg[PSTR("model")] = config.model;
    cfg[PSTR("group")] = config.group;
    cfg[PSTR("broker")] = config.broker;
    cfg[PSTR("port")] = config.port;
    cfg[PSTR("wssid")] = config.wssid;
    cfg[PSTR("ap")] = WiFi.SSID();
    cfg[PSTR("wpass")] = config.wpass;
    cfg[PSTR("dssid")] = config.dssid;
    cfg[PSTR("dpass")] = config.dpass;
    cfg[PSTR("upass")] = config.upass;
    cfg[PSTR("accTkn")] = config.accTkn;
    cfg[PSTR("provDK")] = config.provDK;
    cfg[PSTR("provDS")] = config.provDS;
    cfg[PSTR("logLev")] = config.logLev;
    cfg[PSTR("gmtOff")] = config.gmtOff;
    cfg[PSTR("bFr")] = configcomcu.bFr;
    cfg[PSTR("fP")] = (int)configcomcu.fP;
    cfg[PSTR("fB")] = (int)configcomcu.fB;
    cfg[PSTR("fIoT")] = (int)config.fIoT;
    cfg[PSTR("fWOTA")] = (int)config.fWOTA;
    cfg[PSTR("fIface")] = (int)config.fIface;
    cfg[PSTR("hname")] = config.hname;
    cfg[PSTR("logIP")] = config.logIP;
    cfg[PSTR("logPrt")] = config.logPrt;
    cfg[PSTR("pBz")] = configcomcu.pBz;
    cfg[PSTR("pLR")] = configcomcu.pLR;
    cfg[PSTR("pLG")] = configcomcu.pLG;
    cfg[PSTR("pLB")] = configcomcu.pLB;
    cfg[PSTR("htU")] = config.htU;
    cfg[PSTR("htP")] = config.htP;
    cfg[PSTR("lON")] = configcomcu.lON;
    serializeJson(doc, buffer);
    ws.broadcastTXT(buffer);
  }
  
  log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);

  onSyncClientAttrCb();
}


} // namespace libudawa
#endif